Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
import pandas as pd

In [4]:
data=[4,8,15,16,23,42]

In [5]:
m_series=pd.Series(data)

In [7]:
m_series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [8]:
var_list=[1,3,'aman','hello','pandas']

In [9]:
df=pd.Series(var_list)

In [10]:
df

0         1
1         3
2      aman
3     hello
4    pandas
dtype: object

Create a Pandas DataFrame that contains the following data:

In [16]:
n=['Alice','Bob','Claire']
a=[25,30,27]
g=['Female','Male','Female']

In [17]:
data= {
    'name':n,
    'age':a,
    "gender":g
}

In [18]:
data

{'name': ['Alice', 'Bob', 'Claire'],
 'age': [25, 30, 27],
 'gender': ['Female', 'Male', 'Female']}

In [26]:
pd.DataFrame(data,index=None)

     name  age  gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [27]:
df

     name  age  gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [29]:
df.info(
)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

series and dataframe are the two primary data types in pandas library where series is used to handle one dimension data whereaas Dataframe is used to handle two dimensional data (multi column)

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

there are many functions to manipulate some of them are 
head()------check top 5 records,
tail()------check last 5 records,
Dtype-------check datatype of each column,
describe()---view/check statistical information about the dataframe,
info()-------provide summary of the whole dataframe,

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

series and dataframe both are mutable as we can change the elements add the elements or delete the elements from the series or data frame

In [30]:
my_series=pd.Series([2,4,6,8,10])

In [31]:
my_series

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [32]:
my_series[1]=3

In [33]:
my_series

0     2
1     3
2     6
3     8
4    10
dtype: int64

In [34]:
my_series.drop(3,inplace=True)

In [35]:
my_series

0     2
1     3
2     6
4    10
dtype: int64

In [36]:
df

     name  age  gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [37]:
# Creating a mutable DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35]}
df = pd.DataFrame(data)

In [38]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [39]:
df.at[1,'Age']=32

In [40]:
df

      Name  Age
0    Alice   25
1      Bob   32
2  Charlie   35

In [41]:
new_row={'Name':"aman",'Age':20}

In [46]:
df=pd.concat([df,pd.DataFrame([new_row])], ignore_index=True)

In [47]:
df

      Name  Age
0    Alice   25
1      Bob   32
2  Charlie   35
3     aman   20
4     aman   20
5     aman   20

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [54]:
names=pd.Series(['aman','mariyam','ayesha'])
age=pd.Series([20,12,24])
gender=pd.Series(['M','F','F'])

In [57]:
data={"name":names,
       'age':age,
        'gender':gender}

In [59]:
df=pd.DataFrame(data)

In [60]:
df

      name  age gender
0     aman   20      M
1  mariyam   12      F
2   ayesha   24      F